/******************************************************************************/
/**
*@file    Crc.c      
*@brief   Crc校验源码，包括CRC校验算法实现、字节转换                     
*@author  yangbm
*@version V1.0.0
*@date    2012.03.14
*@details v1.0.0 2012.03.14 yangbm create
*/
/******************************************************************************/

/******************************************************************************/
/**@brief  include                                                            */
/******************************************************************************/
 #include "Typedef.h"
 #include "Crc.h"
  
/******************************************************************************/
/**@brief  CRC校验表                                                                   */
/******************************************************************************/
static uint16_t aus_CrcTable[256]=
{
	0,4129U, 8258U, 12387U, 16516U, 20645U, 24774U, 28903U, 33032U, 37161U, 41290U, 45419U, 49548U, 53677U,
	57806U, 61935U, 4657U, 528U, 12915U, 8786U, 21173U, 17044U, 29431U, 25302U, 37689U, 33560U, 45947U, 41818U,
	54205U, 50076U, 62463U, 58334U,9314U, 13379U, 1056U, 5121U, 25830U, 29895U, 17572U, 21637U, 42346U, 46411U,
	34088U, 38153U, 58862U, 62927U, 50604U, 54669U, 13907U, 9842U, 5649U, 1584U, 30423U, 26358U, 22165U, 18100U, 
	46939U, 42874U, 38681U, 34616U, 63455U, 59390U, 55197U, 51132U, 18628U, 22757U, 26758U, 30887U, 2112U, 6241U, 
	10242U, 14371U, 51660U, 55789U, 59790U, 63919U, 35144U, 39273U, 43274U, 47403U, 23285U, 19156U, 31415U, 
	27286U, 6769U, 2640U, 14899U, 10770U, 56317U, 52188U, 64447U, 60318U, 39801U, 35672U, 47931U, 43802U, 27814U, 
	31879U, 19684U, 23749U, 11298U, 15363U, 3168U, 7233U, 60846U, 64911U, 52716U, 56781U, 44330U, 48395U, 36200U, 
	40265U, 32407U, 28342U, 24277U, 20212U, 15891U, 11826U, 7761U, 3696U, 65439U, 61374U, 57309U, 53244U, 48923U, 
	44858U, 40793U, 36728U, 37256U, 33193U, 45514U, 41451U, 53516U, 49453U, 61774U, 57711U, 4224U, 161U, 12482U, 
	8419U, 20484U, 16421U, 28742U, 24679U, 33721U, 37784U, 41979U, 46042U, 49981U, 54044U, 58239U, 62302U, 689U, 
	4752U, 8947U, 13010U, 16949U, 21012U, 25207U, 29270U, 46570U, 42443U, 38312U, 34185U, 62830U, 58703U, 54572U, 
	50445U, 13538U, 9411U, 5280U, 1153U, 29798U, 25671U, 21540U, 17413U, 42971U, 47098U, 34713U, 38840U, 59231U, 
	63358U, 50973U, 55100U, 9939U, 14066U, 1681U, 5808U, 26199U, 30326U, 17941U, 22068U, 55628U, 51565U, 63758U, 
	59695U, 39368U, 35305U, 47498U, 43435U, 22596U, 18533U, 30726U, 26663U, 6336U, 2273U, 14466U, 10403U, 52093U, 
	56156U, 60223U, 64286U, 35833U, 39896U, 43963U, 48026U, 19061U, 23124U, 27191U, 31254U, 2801U, 6864U, 10931U, 
	14994U, 64814U, 60687U, 56684U, 52557U, 48554U, 44427U, 40424U, 36297U, 31782U, 27655U, 23652U, 19525U, 15522U, 
	11395U, 7392U, 3265U, 61215U, 65342U, 53085U, 57212U, 44955U, 49082U, 36825U, 40952U, 28183U, 32310U, 20053U, 
	24180U, 11923U, 16050U, 3793U, 7920U
};


/*****************************************************************************/
/**
* @brief  uint16_t getCrc16
*         计算16位字长数组的CRC16校验值 
* @param  IN uint16_t aus_Data[]: 需要校验的数据;
* @param  IN int16_t us_Len: 数据长度 
* @return uint16_t:返回校验值
*/
/*****************************************************************************/
uint16_t getCrc16(IN uint16_t aus_Data[], IN int16_t s_Len)
{
	uint16_t us_Crc = 0x0000U;    
	uint16_t us_Count = 0U;
	uint16_t us_Cnt = 0U;
	uint16_t us_Data = 0U;
	uint8_t uc_Ret = SYS_OK;
	
	if (NULLS == aus_Data)
	{
		uc_Ret = SYS_ERR;	
	}
	
	if (SYS_OK == uc_Ret)
	{
		us_Cnt = 0U;
		while( s_Len > 0)
		{ 
			us_Data = aus_Data[us_Cnt]>>8;
			us_Data = (us_Data + aus_Data[us_Cnt])&0xff;
			us_Count =  ((us_Crc>>8) ^ us_Data)&0XFF;
			us_Crc = (us_Crc << 8) ^ aus_CrcTable[us_Count]; 
			us_Cnt++;
			s_Len--;
		}
	} 
	else
	{
		us_Crc = 0;
	}   
	return us_Crc;    
}

/*****************************************************************************/
/**
* @brief  uint16_t getCrc
*         计算8位字长数组的CRC16校验值 
* @param  IN uint16_t aus_Data[]: 需要校验的数据;
* @param  IN int16_t sh_Len: 数据长度 
* @return uint16_t:返回校验值
*/
/*****************************************************************************/
uint16_t getCrc(IN uint8_t auc_Data[], IN int16_t sh_Len)
{
	uint16_t us_Crc = 0x0000;  
	uint16_t us_Count = 0;
	uint8_t  uc_Ret = SYS_OK;
	uint16_t us_Cnt = 0;
	
	if (NULLS == auc_Data)
	{
		uc_Ret = SYS_ERR;	
	}
	
	if (SYS_OK == uc_Ret)
	{
		us_Cnt = 0;
		while( sh_Len > 0)
		{ 
			us_Count =  ((us_Crc>>8) ^ (auc_Data[us_Cnt]&0xff))&0XFF;
			us_Crc = (us_Crc << 8) ^ aus_CrcTable[us_Count]; 
			us_Cnt++;
			sh_Len--;
		}
	} 
	else
	{
		us_Crc = 0;
	}
	   
	return us_Crc;    
}

/*****************************************************************************/
/**
* @brief  void  DWORDToBYTE
*         计算8位字长数组的CRC8校验值 
* @param  OUT uint8_t auc_Buf[]: 转换输出;
* @param  IN uint32_t ui_Data: 转换输入 
* @return void
*/
/*****************************************************************************/
void  DWORDToBYTE(OUT uint8_t auc_Buf[], IN uint32_t ui_Data)
{	
	if(NULLS == auc_Buf)
	{
	
	}
	else
	{
		auc_Buf[0] = ui_Data&0xFFU;
		ui_Data = ui_Data>>8;
		auc_Buf[1] = ui_Data&0xFFU;
		ui_Data = ui_Data>>8;
		auc_Buf[2] = ui_Data&0xFFU;
		ui_Data = ui_Data>>8;
		auc_Buf[3] = ui_Data&0xFFU;
	}
}
/*****************************************************************************/
/**
* @brief  uint32_t  BYTEToDWORD
*         将4字节合并为DWORD
* @param  IN uint8_t auc_Buf[]: 转换输入; 
* @return uint32_t:合并输出
*/
/*****************************************************************************/
uint32_t  BYTEToDWORD(IN uint8_t auc_Buf[])
{
	uint32_t ui_Data = 0U;
	
	if( NULLS == auc_Buf )
	{
		ui_Data = 0U;	
	}
	else
	{
		ui_Data= auc_Buf[3];
		ui_Data = (ui_Data<<8)|auc_Buf[2];
		ui_Data = (ui_Data<<8)|auc_Buf[1];
		ui_Data = (ui_Data<<8)|auc_Buf[0];
	}
	return ui_Data;
}
